<?php

return [

    'profile'               => 'ប្រូហ្វាល់',
    'logout'                => 'ចាកចេញ',
    'login'                 => 'ចូលប្រកម្មវិធី',
    'login_to'              => 'សូមចូលក្នុងប្រព័ន្ធជាមុន',
    'remember_me'           => 'ចងចាំខ្ញុំ',
    'forgot_password'       => 'ខ្ញុំភ្លេចលេខសម្ងាត់',
    'reset_password'        => 'ប្តូរលេខសម្ងាត់',
    'enter_email'           => 'សូមបញ្ចូលអ៊ីម៉ែល',
    'current_email'         => 'អ៊ីម៉ែលកំពុងប្រើប្រាស់',
    'reset'                 => 'ប្តូរឡើងវិញ',
    'never'                 => 'មិនដែល',
    
    'password' => [
        'current'           => 'លេខសម្ងាត់',
        'current_confirm'   => 'លេខសម្ងាត់ម្តងទៀត',
        'new'               => 'លេខសម្ងាត់ថ្មី',
        'new_confirm'       => 'បញ្ជាក់លេខសម្ងាត់ថ្មី',
    ],
    
    'error' => [
        'self_delete'       => 'Error : អ្នកមិនអាចលុបគណនីខ្លួនអ្នកបានទេ !',
        'no_company'        => 'Error : គណនីរបស់មិនមានក្រុមហ៊ុនណាមួយទេ។ សូមទំនាក់ទំនងអ្នកគ្រប់គ្រងដើម្បីចូលក្នុងក្រុមហ៊ុនណាមួយ!',
    ],

    'failed'                => 'គណនីឬលេខសម្ងាត់មិនត្រឹមត្រូវទេ',
    'disabled'              => 'គណនីនេះមិនអាចប្រើប្រាស់បានទេ សូមទំនាក់ទំនងអ្នកគ្រប់គ្រង។',
    'throttle'              => 'អ្នកព្យាយាមចូលច្រើនដងពេកហើយ។ សូមព្យាយាមម្តងទៀតក្នុងរយៈពេល :seconds វិនាទី។',

    'notification' => [
        'message_1'     => 'លោកអ្នកទទួលបានសារនេះ ពីព្រោះយើងខ្ញុំទទួលបាន​ ការស្នើរសុំប្តូរលេខសម្ងាត់ពីគណនីរបស់អ្នក។',
        'message_2'     => 'ប្រើសិនបើអ្នកមិនបានស្នើរសុំប្តូរលេខសម្ងាត់ទេ, អ្នកមិនចាំបាច់ធ្វើអ្វិទៀតទេ។',
        'button'        => 'ប្តូរលេខសម្ងាត់',
    ],

];
